[{
    "title": "Tennis Shoes Among the Nephites",
    "author": "Chris Heimerdinger",
    "published": "1989",
    "pgCount": "298",
    "synopsis": "Jim Hawkins is a bored 12 year old in Wyoming. He, his sister, and the school nerd he bullies fall down a waterfall inside a local cave, and wind up in Nephite history.",
    "genre": "Historical Fiction",
    "audience": "Teens"
},
{
    "title": "The Flight Girls",
    "author": "Noelle Salazar",
    "published": "2019",
    "pgCount": "384",
    "synopsis": "Audrey Coltrane is a military flight instructor in Hawaii in 1941. She and her friends try to find their way forward after Pearl Harbor is bombed.",
    "genre": "Historical Fiction",
    "audience": "Adults"
},
{
    "title": "Rebekah: Women of Genesis",
    "author": "Orson Scott Card",
    "published": "2001",
    "pgCount": "413",
    "synopsis": "Rebekah leaves her father's house to marry Isaac, son of Abraham, she struggles to find her place in the patriarch's family and her own path to serving God. Sensitive to Christian tradition but also to the plight of women in Biblical times, this imaginative, inspiring story offers a unique look at early Christianity's domestic culture.",
    "genre": "Historical Fiction",
    "audience": "Adults"
},
{
    "title": "Fire of the Covenant--",
    "author": "Gerald N. Lund",
    "published": "1999",
    "pgCount": "764",
    "synopsis": "Trapped by early winter snows in Wyoming, these Saints driven by the 'fire of the covenant' they had made with God rose to height of unsurpassed courage and endurance. Their story will thrill you to the core.",
    "genre": "Historical Fiction",
    "audience": "Adults"
},
{
    "title": "Praying with the Enemey",
    "author": "Steven T. Collins",
    "published": "2022",
    "pgCount": "320",
    "synopsis": "When pilot Captain Ward Millar is forced to eject over enemy territory in North Korea, the ejection explosion snaps both of his ankles. Unable to walk, he is easily captured by North Korean and Chinese soldiers who interrogate, threaten, and starve him for strategic wartime information.",
    "genre": "Historical Fiction",
    "audience": "Adults"
}
]