[{
    "title": "Paper Towns",
    "author": "John Green",
    "published": "2009",
    "pgCount": "336",
    "synopsis": "When Margo Roth Spiegelman beckons Quentin Jacobsen in the middle of the night—dressed like a ninja and plotting an ingenious campaign of revenge—he follows her. Margo’s always planned extravagantly, and, until now, she’s always planned solo. After a lifetime of loving Margo from afar, things are finally looking up for Q . . . until day breaks and she has vanished. Always an enigma, Margo has now become a mystery. But there are clues. And they are for Q.",
    "genre": "Mystery",
    "audience": "Teen"
},
{
    "title": "One of Us Is Lying",
    "author": "Karen M. McManus",
    "published": "2023",
    "pgCount": "416",
    "synopsis": "Only, Simon never makes it out of that classroom. Before the end of detention Simon's dead. And according to investigators, his death wasn’t an accident. On Monday, he died. But on Tuesday, he’d planned to post juicy reveals about all four of his high-profile classmates, which makes all four of them suspects in his murder. Or are they the perfect patsies for a killer who’s still on the loose?",
    "genre": "Mystery",
    "audience": "Teen"
},
{
    "title": "The Last Party",
    "author" : "Clare Mackintosh",
    "published": "2022",
    "pgCount": "432",
    "synopsis": "At midnight, one of them is dead. By morning, all of them are suspects.",
    "genre": "Mystery",
    "audience": "Adult"
},
{
    "title": "Thirteen Reasons Why",
    "author" : "Jay Asher",
    "published": "2011",
    "pgCount": "336",
    "synopsis": "Clay Jensen returns home from school to find a strange package with his name on it lying on his porch. Inside he discovers several cassette tapes recorded by Hannah Baker—his classmate and crush—who committed suicide two weeks earlier. Hannah's voice tells him that there are thirteen reasons why she decided to end her life. Clay is one of them. If he listens, he'll find out why.",
    "genre": "Mystery",
    "audience": "Young Adult"
}]